{"posted": [{"headline": "Kevin De Bruyne has revealed whether he is the current Manchester City captain or Kyle Walker. While Walker has donned the armband for the majority…", "banner_image": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1412267132-1140x760.jpg"}, {"headline": "Nicolas Otamendi has admitted that he would love to see Bernardo Silva put pen to make a move to Benfica one day. The former Manchester…", "banner_image": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1412267132-1140x760.jpg"}, {"headline": "Kevin De Bruyne clears up whether him or Kyle Walker is the new Manchester City captain", "banner_image": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1412267132-1140x760.jpg"}, {"It has been revealed that Fernandinho believes David Silva was better than Neymar.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1721277788-750x500.jpg"}, {"Erling Haaland showed his faith in Jeremy Doku on Sunday as the Belgian prepared to come on for Manchester City against Huddersfield.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1745423654-scaled-e1704811036616-750x457.jpg"}, {"Cole Palmer opted for Kevin De Bruyne and Erling Haaland in his dream five-a-side team.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1778827051-1-750x500.jpg"}, {"Manchester City fans have now reacted after the Football Association announced that Tottenham await Pep Guardiola in the FA Cup fourth round.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1904889334-750x527.jpg"}, {"Jude Bellingham approved of Jamie Carragher picking John Stones in his EA FC 24 Team of the Year.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1735217468-750x487.jpg"}, {"Jamie Carragher has compared John Stones to his England teammate, Trent Alexander-Arnold.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1819250145-750x558.jpg"}, {"John Terry believes Frank Lampard was better than Manchester City maestro Kevin De Bruyne.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1856847991-750x500.jpg"}, {"Vitor Roque rejected an offer from Manchester City to join Barcelona in a move from Athletico Paranaense.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1863290524-750x500.jpg"}, {"Kevin De Bruyne has now confirmed that Kyle Walker is the captain of Manchester City – not him.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1914953809-1-750x524.jpg"}, {"Manchester City thumped Huddersfield Town 5-0 in the FA Cup third round – and fans finally got to witness Kevin De Bruyne playing football again.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1907474233-750x508.jpg"}, {"Huddersfield Town boss Darren Moore reserved special praise for Manchester City midfielder Phil Foden.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1914765193-750x500.jpg"}, {"Joleon Lescott has now claimed that only Manchester City No.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1476303756-750x500.jpg"}, {"Joleon Lescott has now shared why he thinks Pep Guardiola will leave Kevin De Bruyne on the bench when Manchester City face Newcastle on Saturday.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1914647345-1-750x500.jpg"}, {"Manchester City loanee Yan Couto has now admitted he would like to join Real Madrid one day.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1257400199-750x503.jpg"}, {"Micah Richards opted for Erling Haaland to lead the line in his EA FC 24 Team of The Year.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1491550851-1-750x500.jpg"}, {"Rio Ferdinand has backed Josko Gvardiol to develop into a top player for Manchester City.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1692663046-750x500.jpg"}, {"Manchester City are reportedly now facing competition for Joshua Kimmich from Paris Saint-Germain, who want the star either this month or in the summer.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1822663249-750x500.jpg"}, {"Micah Hamilton has heaped praise on Oscar Bobb.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1865216839-750x500.jpg"}, {"Micah Hamilton has revealed that he is inspired by Manchester City teammate Rico Lewis.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1912640894-1-750x500.jpg"}, {"Pep Guardiola has admitted that there is one possibility that still scares him at Manchester City, despite having been such a success at the club.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1880767872-750x500.jpg"}, {"Cole Palmer has now opened up on his departure from Manchester City after an impressive start to life at Chelsea.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1221675635-4-750x514.jpg"}, {"Joleon Lescott has emphasised how Kevin De Bruyne almost always plays the correct pass.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1691055684-750x500.jpg"}, {"Manchester City are now keen to sign Hayden Hackney from Middlesbrough.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-151462655-scaled-e1704881352829-750x448.jpg"}, {"Pep Guardiola has now reacted after being shown footage from Manchester City’s 5-0 win over Huddersfield on Sunday.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1907312327-750x500.jpg"}, {"Manchester City youngster Alex Robertson may not play again this season, after suffering a torn hamstring while on loan at Portsmouth.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1308000749-750x501.jpg"}, {"Manchester City are actually worried about Kalvin Phillips decreasing his value if he moves to Newcastle on loan.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1856615736-750x500.jpg"}, {"Manchester City are back in Premier League action on Saturday after last week’s 5-0 FA Cup win over Huddersfield.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1625713191-750x500.jpg"}, {"Cole Palmer has said that Pep Guardiola taught him “everything” about football.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1879567431-750x532.jpg"}, {"Callum Wilson has praised Kevin De Bruyne ahead of Saturday’s Premier League clash between Newcastle and Manchester City.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1221675413-750x469.jpg"}, {"Gary Neville says John Stones was better than Trent Alexander-Arnold last year.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1890818122-1-750x508.jpg"}, {"Paul Merson has now shared his thoughts as Manchester City begin to welcome Kevin De Bruyne and Erling Haaland back into the fold.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1833643051-750x499.jpg"}, {"Gary Neville has said that Kyle Walker would have been in his Team of The Year.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1877338355-750x500.jpg"}, {"Carlos Tevez has now shared his thoughts on Claudio Echeverri as the River Plate wonderkid prepares to join Manchester City.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-165108533-scaled-e1704969301494-750x451.jpg"}, {"Gary Neville says Kevin De Bruyne had the edge over Bernardo Silva in the year, 2023.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1904886622-1-750x542.jpg"}, {"Micah Richards has now reacted after Gary Lineker shared an interesting fact about Manchester City No.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1709764478-scaled-e1705078853923-750x444.jpg"}, {"Sven-Goran Eriksson has said that former Manchester City midfielder, Michael Johnson, may have been better than Steven Gerrard.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-81066232-750x434.jpg"}, {"Yaya Toure has now praised Leroy Sane – who Manchester City sold to Bayern Munich in 2020.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-114177190-750x499.jpg"}, {"David Ornstein has said that Manchester City will look at landing a summer transfer deal for Pedro Neto.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1857006888-750x500.jpg"}, {"Jude Bellingham has expressed his amazement at the talent of Ilkay Gundogan – who left Manchester City in 2023.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1724844218-750x510.jpg"}, {"Nathan Ake has shared some behind-the-scenes details on what Pep Guardiola did ahead of Manchester City’s Champions League final clash against Inter Milan.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1258986392-750x500.jpg"}, {"Eddie Howe has been speaking about Manchester City as he and Newcastle prepare to take on Pep Guardiola this Saturday.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1859847381-750x473.jpg"}, {"David Ornstein has said that he expects Kalvin Phillips to leave Manchester City this month.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1244425462-750x500.jpg"}, {"Sven-Goran Eriksson has shared what it was like to work alongside Former Manchester City player Elano.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-110680057-750x547.jpg"}, {"Manchester City fans have spotted something fascinating in the background of a video posted by the club.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1390646149-750x434.jpg"}, {"Nathan Ake has revealed that Manchester City players recently copied something Fernandinho did back in January 2021.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-882003986-750x541.jpg"}, {"Pep Guardiola must include Nathan Ake in his starting XI for Manchester City’s upcoming Premier League match against Newcastle United.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1894812289-2-750x500.jpg"}, {"Chris Sutton has shared his prediction for Manchester City’s upcoming Premier League clash against Newcastle United.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1704786988-750x500.jpg"}, {"Former Manchester City manager Stuart Pearce has revealed why the club had to sell Shaun Wright-Phillips to Chelsea back in 2005.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-52828613-750x496.jpg"}, {"Erling Haaland has sent a message to Manchester City academy graduate Jadon Sancho after the England international sealed a loan move to Borussia Dortmund.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1820386246-scaled-e1705086022732-750x470.jpg"}, {"Pep Guardiola has said that Manchester City midfielder Kevin De Bruyne is ready to start against Newcastle United this weekend.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1912663986-3-750x536.jpg"}, {"Pundit Glenn Murray has backed Kevin De Bruyne to fire Manchester City to the Premier League title.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1888255249-750x500.jpg"}, {"Sky Sports journalist Dharmesh Sheth has shared some details regarding Juventus’ stance on potentially signing Manchester City midfielder Kalvin Phillips this month.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1873184763-1-750x500.jpg"}, {"David Villa has named former Manchester City star David Silva as the smartest player he has ever seen.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1244360466-750x500.jpg"}, {"Phil Foden has shared how much he is enjoying playing alongside Manchester City teammate Julian Alvarez.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1887466593-750x500.jpg"}, {"Pep Guardiola has shared an injury update concerning Manchester City defender Manuel Akanji.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1912667205-2-750x536.jpg"}, {"Pep Guardiola has praised Manchester City midfielder Phil Foden for his current run of form.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1899983613-2-750x457.jpg"}, {"Richard Dunne has praised Manchester City for their signing of Jeremy Doku.": "https://cdn1.manchestercity.news/uploads/30/2024/01/GettyImages-1930119809-750x500.jpg"}]}